assignment2/part8/MeshD/dt=0.01/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          160;
        startFace       63520;
    }
    outlet
    {
        type            patch;
        nFaces          160;
        startFace       63680;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          320;
        startFace       63840;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          160;
        startFace       64160;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          160;
        startFace       64320;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          64000;
        startFace       64480;
    }
)

// ************************************************************************* //
